Repository: Fpied/LoGeCui
Catalog: LoGeCuiMobile/Resources/Lang/AppResources.*.resx
Languages: cs, es, it, ja, ko, pt_pt, ru, uk, zh

source: Email
es: Correo electrónico
ja: 電子メール
ko: 이메일
pt_pt: Correio eletrónico
ru: Электронная почта
uk: Електронна пошта
zh: 电子邮件

# Password
source: Mot de passe
cs: Heslo
es: Contraseña
it: Password
ja: パスワード
ko: 비밀번호
pt_pt: Palavra-passe
ru: Пароль
uk: Пароль
zh: 密码

# StayConnected
source: Rester connecté
cs: Zůstat ve spojení
es: Permanecer conectado
it: Rimanere connessi
ja: つながりを保つ
ko: 연결 상태 유지
pt_pt: Manter-se ligado
ru: Оставайтесь на связи
uk: Залишатися на зв'язку
zh: 保持联系

# LoginButton
source: Se connecter
cs: Přihlásit se
es: Iniciar sesión
it: Accedi
ja: ログイン
ko: 로그인
pt_pt: Iniciar sessão
ru: Войти
uk: Увійдіть в систему
zh: 登录

# SignupButton
source: Créer un compte
cs: Vytvoření účtu
es: Crear una cuenta
it: Creare un account
ja: アカウントの作成
ko: 계정 만들기
pt_pt: Criar uma conta
ru: Создать учетную запись
uk: Створіть обліковий запис
zh: 创建账户

# ForgotPassword
source: Mot de passe oublié ?
cs: Zapomněli jste heslo?
es: ¿Ha olvidado su contraseña?
it: Avete dimenticato la password?
ja: パスワードをお忘れですか？
ko: 비밀번호를 잊어버리셨나요?
pt_pt: Esqueceu-se da sua palavra-passe?
ru: Забыли пароль?
uk: Забули пароль?
zh: 忘记密码？

# ErrorTitle
source: Erreur
cs: Chyba
es: Error
it: Errore
ja: エラー
ko: 오류
pt_pt: Erro
ru: Ошибка
uk: Помилка.
zh: 错误

# BadPassword
source: Mauvais mot de passe
cs: Špatné heslo
es: Contraseña incorrecta
it: Password sbagliata
ja: パスワードの間違い
ko: 잘못된 비밀번호
pt_pt: Palavra-passe errada
ru: Неверный пароль
uk: Неправильний пароль
zh: 密码错误

# Connecting
source: Connexion en cours...
cs: Připojení probíhá...
es: Conexión en curso...
it: Connessione in corso...
ja: 接続中...
ko: 연결 진행 중...
pt_pt: Ligação em curso...
ru: Подключение продолжается...
uk: Триває підключення...
zh: 连接中...

# FillAllFields
source: Veuillez remplir tous les champs
cs: Vyplňte prosím všechna pole
es: Rellene todos los campos
it: Compilare tutti i campi
ja: すべての欄にご記入ください。
ko: 모든 필드를 작성해 주세요.
pt_pt: Preencher todos os campos
ru: Пожалуйста, заполните все поля
uk: Будь ласка, заповніть усі поля
zh: 请填写所有栏目

# ConnectionError
source: Erreur de connexion
cs: Chyba připojení
es: Error de conexión
it: Errore di connessione
ja: 接続エラー
ko: 연결 오류
pt_pt: Erro de ligação
ru: Ошибка подключения
uk: Помилка підключення
zh: 连接错误

# CreatingAccount
source: Création du compte...
cs: Vytvoření účtu...
es: Crear una cuenta...
it: Creare un account...
ja: アカウントの作成...
ko: 계정 만들기...
pt_pt: Criar uma conta...
ru: Создание учетной записи...
uk: Створення облікового запису...
zh: 创建账户...

# SignupError
source: Erreur lors de l'inscription
cs: Chyba registrace
es: Error de registro
it: Errore di registrazione
ja: 登録エラー
ko: 등록 오류
pt_pt: Erro de registo
ru: Ошибка регистрации
uk: Помилка реєстрації
zh: 注册错误

# Shopping_Title
source: 🛒 Liste de Courses
cs: 🛒 Seznam závodů
es: 🛒 Lista de razas
it: 🛒 Elenco delle razze
ja: 🛒 レース一覧
ko: 🛒 레이스 목록
pt_pt: 🛒 Lista de raças
ru: 🛒 Список рас
uk: 🛒 Список перегонів
zh: 🛒 种族名单

# Shopping_Header
source: Ma liste de courses
cs: Můj nákupní seznam
es: Mi lista de la compra
it: La mia lista della spesa
ja: 買い物リスト
ko: 내 쇼핑 목록
pt_pt: A minha lista de compras
ru: Мой список покупок
uk: Мій список покупок
zh: 我的购物清单

# Shopping_AddItem
source: ➕ Ajouter un article
cs: ➕ Přidat položku
es: ➕ Añadir un elemento
it: ➕ Aggiungere un elemento
ja: アイテムを追加する
ko: ➕ 항목 추가
pt_pt: Adicionar um item
ru: ➕ Добавить элемент
uk: ➕ Додати елемент
zh: ➕ 添加一个项目

# Shopping_DeleteSelection
source: 🗑️ Supprimer sélection
cs: 🗑️ Odstranit výběr
es: 🗑️ Borrar selección
it: 🗑️ Cancellare la selezione
ja: 🗑️ 削除選択
ko: 🗑️ 선택 항목 삭제
pt_pt: 🗑️ Eliminar seleção
ru: 🗑️ Удалить выбор
uk: 🗑️ Видалити вибір
zh: 🗑️ 删除选择

# Shopping_Empty
source: Aucun article pour l’instant.
cs: Zatím žádný článek.
es: Aún no hay artículo.
it: Non c'è ancora un articolo.
ja: まだ記事はない。
ko: 아직 게시물이 없습니다.
pt_pt: Nenhum artigo ainda.
ru: Пока нет статьи.
uk: Статті ще немає.
zh: 尚无文章。

# Shopping_Bought
source: Acheté
cs: Zakoupeno na
es: Comprado
it: Acquistato
ja: 購入
ko: 구매
pt_pt: Comprado
ru: Приобретено
uk: Куплено
zh: 已购买

# Shopping_Delete
source: Supprimer
cs: Odstranit
es: Borrar
it: Cancellare
ja: 削除
ko: 삭제
pt_pt: Eliminar
ru: Удалить
uk: Видалити
zh: 删除

# Nav_ShoppingList
source: Liste de courses
cs: Nákupní seznam
es: Lista de la compra
it: Lista della spesa
ja: 買い物リスト
ko: 쇼핑 목록
pt_pt: Lista de compras
ru: Список покупок
uk: Список покупок
zh: 购物清单

# Nav_Recipes
source: Mes recettes
cs: Moje recepty
es: Mis recetas
it: Le mie ricette
ja: 私のレシピ
ko: 내 레시피
pt_pt: As minhas receitas
ru: Мои рецепты
uk: Мої рецепти
zh: 我的食谱

# Nav_RandomMenu
source: Menu aléatoire
cs: Náhodné menu
es: Menú aleatorio
it: Menu casuale
ja: ランダムメニュー
ko: 랜덤 메뉴
pt_pt: Menu aleatório
ru: Произвольное меню
uk: Випадкове меню
zh: 随机菜单

# Nav_Ingredients
source: Ingrédients
cs: Složení
es: Ingredientes
it: Ingredienti
ja: 原材料
ko: 재료
pt_pt: Ingredientes
ru: Ингредиенты
uk: Інгредієнти
zh: 配料

# Nav_Settings
source: Paramètres
cs: Parametry
es: Parámetros
it: Parametri
ja: パラメータ
ko: 매개변수
pt_pt: Parâmetros
ru: Параметры
uk: Параметри
zh: 参数

# Dialog_Ok
source: OK
ko: 확인
uk: ГАРАЗД.
zh: 好的

# Dialog_Yes
source: Oui
cs: Ano
es: Sí
it: Sì
ja: はい
ko: 예
pt_pt: Sim
ru: Да
uk: Так.
zh: 是

# Dialog_No
source: Non
cs: Ne
es: No
it: No
ja: いいえ
ko: 아니요
pt_pt: Não
ru: Нет
uk: Ні.
zh: 没有

# Dialog_Cancel
source: Annuler
cs: Zrušit
es: Cancelar
it: Annullamento
ja: キャンセル
ko: 취소
pt_pt: Cancelar
ru: Отмена
uk: Скасувати
zh: 取消

# SuccessTitle
source: ✅ OK
ko: ✅ 확인
uk: ГАРАЗД.
zh: ✅ 确定

# PermissionTitle
source: 🔒 Permission
cs: 🔒 Povolení
es: 🔒 Permiso
it: 🔒 Autorizzazione
ja: 🔒 許可
ko: 🔒 권한
pt_pt: 🔒 Permissão
ru: 🔒 Разрешение
uk: Дозвіл
zh: 🔒 许可

# UnknownError
source: Erreur inconnue.
cs: Neznámá chyba.
es: Error desconocido.
it: Errore sconosciuto.
ja: 不明なエラー。
ko: 알 수 없는 오류입니다.
pt_pt: Erro desconhecido.
ru: Неизвестная ошибка.
uk: Невідома помилка.
zh: 未知错误。

# ServiceUnavailable
source: Service indisponible.
cs: Služba není k dispozici.
es: Servicio no disponible.
it: Servizio non disponibile.
ja: サービスは利用できない。
ko: 서비스를 사용할 수 없습니다.
pt_pt: Serviço indisponível.
ru: Сервис недоступен.
uk: Послуга недоступна.
zh: 无法提供服务。

# LoginRequired
source: Vous devez être connecté.
cs: Musíte být přihlášeni.
es: Debes haber iniciado sesión.
it: È necessario aver effettuato l'accesso.
ja: ログインが必要です。
ko: 로그인해야 합니다.
pt_pt: Tem de estar registado.
ru: Вы должны войти в систему.
uk: Ви повинні увійти в систему.
zh: 您必须已登录。

# SessionTitle
source: Session
cs: Relace
es: Sesión
it: Sessione
ja: セッション
ko: 세션
pt_pt: Sessão
ru: Сессия
uk: Сесія
zh: 会议

# SessionExpired
source: Session absente ou expirée. Veuillez vous reconnecter.
cs: Zmeškaná nebo vypršená relace. Přihlaste se znovu.
es: Sesión perdida o caducada. Por favor, conéctese de nuevo.
it: Sessione persa o scaduta. Effettuare nuovamente il login.
ja: セッションに参加できなかったか、有効期限が切れています。再度ログインしてください。
ko: 세션이 누락되었거나 만료되었습니다. 다시 로그인해 주세요.
pt_pt: Sessão perdida ou expirada. Inicie sessão novamente.
ru: Пропущена или истекла сессия. Пожалуйста, войдите в систему снова.
uk: Пропущена або прострочена сесія. Будь ласка, увійдіть знову.
zh: 错过会话或会话过期。请重新登录。

# Ingredients_Add_Title
source: Ajouter un ingrédient
cs: Přidání složky
es: Añadir un ingrediente
it: Aggiungere un ingrediente
ja: 食材の追加
ko: 재료 추가
pt_pt: Adicionar um ingrediente
ru: Добавить ингредиент
uk: Додати інгредієнт
zh: 添加配料

# Ingredients_Add_NamePlaceholder
source: Nom de l’ingrédient
cs: Název složky
es: Nombre del ingrediente
it: Nome dell'ingrediente
ja: 成分名
ko: 성분 이름
pt_pt: Nome do ingrediente
ru: Название ингредиента
uk: Назва інгредієнта
zh: 成分名称

# Ingredients_Add_QuantityPlaceholder
source: Quantité (ex : 10)
cs: Množství (např. 10)
es: Cantidad (por ejemplo, 10)
it: Quantità (ad es. 10)
ja: 数量（例：10）
ko: 수량(예: 10)
pt_pt: Quantidade (por exemplo, 10)
ru: Количество (например, 10)
uk: Кількість (наприклад, 10)
zh: 数量（例如 10）

# Ingredients_Add_UnitPlaceholder
source: Unité (ex : kg, pièces)
cs: Jednotka (např. kg, kusy)
es: Unidad (por ejemplo, kg, piezas)
it: Unità (ad es. kg, pezzi)
ja: 単位（kg、個数など）
ko: 단위(예: kg, 조각)
pt_pt: Unidade (por exemplo, kg, unidades)
ru: Единица измерения (например, кг, штук)
uk: Одиниця виміру (наприклад, кг, шт.)
zh: 单位（如公斤、件数）

# Ingredients_Add_Available
source: Disponible
cs: K dispozici na adrese
es: Disponible en
it: Disponibile presso
ja: 下記にて入手可能
ko: 다음에서 사용 가능
pt_pt: Disponível em
ru: Доступно по адресу
uk: Доступно за адресою
zh: 网址

# Ingredients_Add_Save
source: 💾 Enregistrer
cs: 💾 Registr
es: 💾 Registro
it: Registro 💾
ja: 💾 レジスター
ko: 💾 등록하기
pt_pt: 💾 Registo
ru: 💾 Регистр
uk: 💾 Зареєструватися
zh: 💾 登记册

# Ingredients_Add_NameRequired
source: Le nom est obligatoire.
cs: Název je povinný.
es: El nombre es obligatorio.
it: Il nome è obbligatorio.
ja: 名前は必須である。
ko: 이름은 필수입니다.
pt_pt: O nome é obrigatório.
ru: Название является обязательным.
uk: Ім'я обов'язкове.
zh: 名称是必填项。

# Ingredients_Title
source: Gestion des ingrédients
cs: Správa složek
es: Gestión de los ingredientes
it: Gestione degli ingredienti
ja: 食材の管理
ko: 재료 관리
pt_pt: Gestão de ingredientes
ru: Управление ингредиентами
uk: Керування інгредієнтами
zh: 成分管理

# Ingredients_AddButton
source: ➕ Ajouter un ingrédient
cs: ➕ Přidat složku
es: ➕ Añadir un ingrediente
it: ➕ Aggiungere un ingrediente
ja: ➕ 食材を追加する
ko: 재료 추가하기
pt_pt: Adicionar um ingrediente
ru: ➕ Добавить ингредиент
uk: ➕ Додайте інгредієнт
zh: ➕ 添加食材

# Ingredients_QuantityFormat
source: Quantité : {0} {1}
cs: Množství: {0} {1}
es: Cantidad: {0} {1}
it: Quantità: {0} {1}
ja: 数量: {0} {1}
ko: 수량: {0} {1}
pt_pt: Quantidade: {0} {1}
ru: Количество: {0} {1}
uk: Кількість: {0} {1}
zh: 数量： {0} {1}

# Ingredients_Available
source: Disponible
cs: K dispozici na adrese
es: Disponible en
it: Disponibile presso
ja: 下記にて入手可能
ko: 다음에서 사용 가능
pt_pt: Disponível em
ru: Доступно по адресу
uk: Доступно за адресою
zh: 网址

# Ingredients_DialogTitle
source: Ingrédient
cs: Přísady
es: Ingrediente
it: Ingrediente
ja: 原材料
ko: 성분
pt_pt: Ingrediente
ru: Ингредиент
uk: Інгредієнт
zh: 成分

# Recipes_Add_Title
source: Ajouter une recette
cs: Přidání receptu
es: Añadir una receta
it: Aggiungere una ricetta
ja: レシピを追加する
ko: 레시피 추가
pt_pt: Adicionar uma receita
ru: Добавить рецепт
uk: Додати рецепт
zh: 添加食谱

# Recipes_Add_NameLabel
source: Nom
cs: Název
es: Nombre
it: Nome
ja: 名称
ko: 이름
pt_pt: Nome
ru: Имя
uk: Ім'я
zh: 名称

# Recipes_Add_NamePlaceholder
source: Nom de la recette
cs: Název receptu
es: Nombre de la receta
it: Nome della ricetta
ja: レシピ名
ko: 레시피 이름
pt_pt: Nome da receita
ru: Название рецепта
uk: Назва рецепта
zh: 食谱名称

# Recipes_Add_CategoryLabel
source: Catégorie
cs: Kategorie
es: Categoría
it: Categoria
ja: カテゴリー
ko: 카테고리
pt_pt: Categoria
ru: Категория
uk: Категорія
zh: 类别

# Recipes_Add_CategoryPlaceholder
source: Choisir une catégorie
cs: Vyberte kategorii
es: Elija una categoría
it: Scegliere una categoria
ja: カテゴリーを選ぶ
ko: 카테고리 선택
pt_pt: Selecionar uma categoria
ru: Выберите категорию
uk: Виберіть категорію
zh: 选择类别

# Recipes_Add_TimeLabel
source: Temps (minutes)
cs: Čas (v minutách)
es: Tiempo (minutos)
it: Tempo (minuti)
ja: 時間（分）
ko: 시간(분)
pt_pt: Tempo (minutos)
ru: Время (минуты)
uk: Час (хвилини)
zh: 时间（分钟）

# Recipes_Add_TimePlaceholder
source: Ex : 30
ja: 例：30
ko: 예 : 30
ru: Экс : 30

# Recipes_Add_IngredientsLabel
source: Ingrédients (1 par ligne)
cs: Složení (1 na řádek)
es: Ingredientes (1 por línea)
it: Ingredienti (1 per riga)
ja: 材料（1行に1つ）
ko: 재료(한 줄당 1개)
pt_pt: Ingredientes (1 por linha)
ru: Ингредиенты (1 на строку)
uk: Інгредієнти (1 на рядок)
zh: 配料（每行 1 种）

# Recipes_Add_IngredientsPlaceholder
source: Ex : 2 œufs 100g farine 1 pincée de sel
cs: Např: 2 vejce 100 g mouky 1 špetka soli
es: Ej: 2 huevos 100 g de harina 1 pizca de sal
it: Es: 2 uova 100 g di farina 1 pizzico di sale
ja: 例 卵 2個 小麦粉 100g 塩 ひとつまみ
ko: 예: 달걀 2개 밀가루 100g 소금 1꼬집
pt_pt: Ex: 2 ovos 100g de farinha 1 pitada de sal
ru: Экз: 2 яйца 100 г муки 1 щепотка соли
uk: Колишній: 2 яйця 100 г борошна 1 щіпка солі
zh: 例如 2 枚鸡蛋 100 克面粉 1 小撮盐

# Recipes_Add_InstructionsLabel
source: Instructions
cs: Pokyny
es: Instrucciones
it: Istruzioni
ja: 使用方法
ko: 지침
pt_pt: Instruções
ru: Инструкции
uk: Інструкція
zh: 说明

# Recipes_Add_InstructionsPlaceholder
source: Ex : Mélanger, cuire 10 min...
cs: Například: Smíchejte, vařte 10 minut...
es: Ej: Mezclar, cocer 10 min...
it: Es: Mescolare, cuocere per 10 min...
ja: 例：混ぜて10分煮る。
ko: 예: 혼합, 10분간 조리...
pt_pt: Ex: Misturar, cozer durante 10 min...
ru: Например: смешать, варить 10 минут...
uk: Приклад: перемішати, варити 10 хвилин...
zh: 例如：混合，煮 10 分钟...

# Recipes_Add_ScanOcr
source: Scanner (OCR)
cs: Skenování (OCR)
es: Escaneado (OCR)
it: Scansione (OCR)
ja: スキャニング（OCR）
ko: 스캔(OCR)
pt_pt: Digitalização (OCR)
ru: Сканирование (OCR)
uk: Сканування (OCR)
zh: 扫描（OCR）

# Recipes_Add_Save
source: Enregistrer
cs: Registrace
es: Regístrese en
it: Registro
ja: 登録
ko: 등록하기
pt_pt: Registo
ru: Регистрация
uk: Зареєструватися
zh: 注册

# Recipes_Add_LoginRequired
source: Vous devez être connecté.
cs: Musíte být přihlášeni.
es: Debes estar conectado.
it: È necessario aver effettuato l'accesso.
ja: ログインが必要です。
ko: 로그인해야 합니다.
pt_pt: Tem de estar registado.
ru: Вы должны войти в систему.
uk: Ви повинні увійти в систему.
zh: 您必须已登录。

# Recipes_Add_ServiceNotReady
source: RecetteIngredientsService non initialisé.
cs: Služba RecipeIngredientsService nebyla inicializována.
es: RecipeIngredientsService no inicializado.
it: RecipeIngredientsService non inizializzato.
ja: RecipeIngredientsService が初期化されていません。
ko: RecipeIngredients서비스가 초기화되지 않았습니다.
pt_pt: RecipeIngredientsService não inicializado.
ru: RecipeIngredientsService не инициализирован.
uk: RecipeIngredientsService не ініціалізовано.
zh: RecipeIngredientsService 未初始化。

# Recipes_Add_NameRequired
source: Le nom est obligatoire.
cs: Název je povinný.
es: El nombre es obligatorio.
it: Il nome è obbligatorio.
ja: 名前は必須である。
ko: 이름은 필수입니다.
pt_pt: O nome é obrigatório.
ru: Название является обязательным.
uk: Ім'я обов'язкове.
zh: 名称是必填项。

# Recipes_Add_IdNotFound
source: Impossible de retrouver l'ID de la recette après sauvegarde.
cs: Po uložení nelze najít ID receptu.
es: Imposible encontrar el ID de la receta después de guardarla.
it: Impossibile trovare l'ID della ricetta dopo il salvataggio.
ja: 保存後にレシピIDを見つけることができない。
ko: 저장 후 레시피 ID를 찾을 수 없습니다.
pt_pt: É impossível encontrar a identificação da receita depois de a guardar.
ru: Невозможно найти идентификатор рецепта после сохранения.
uk: Неможливо знайти ідентифікатор рецепта після збереження.
zh: 保存后无法找到配方 ID。

# Recipes_Add_Saved
source: ✅ Recette enregistrée.
cs: ✅ Zaznamenáno přijetí.
es: ✅ Recibo registrado.
it: ✅ Ricevuta registrata.
ja: ✅ レシートを記録。
ko: ✅ 영수증 기록.
pt_pt: Registo da receção.
ru: ✅ Квитанция записана.
uk: ✅ Квитанція зафіксована.
zh: ✅ 记录收据。

# Recipes_Add_ScanTitle
source: 📸 Scanner une recette
cs: 📸 Naskenovat recept
es: 📸 Escanear una receta
it: 📸 Scansione di una ricetta
ja: 📸 レシピをスキャンする
ko: 📸 레시피 스캔
pt_pt: 📸 Digitalizar uma receita
ru: 📸 Сканирование рецепта
uk: Відскануйте рецепт
zh: 📸 扫描食谱

# Recipes_Add_CameraPermission
source: L'accès à la caméra est requis pour scanner.
cs: Pro skenování je nutný přístup ke kameře.
es: Para escanear es necesario acceder a la cámara.
it: Per la scansione è necessario accedere alla fotocamera.
ja: スキャンにはカメラへのアクセスが必要です。
ko: 스캔하려면 카메라에 액세스해야 합니다.
pt_pt: O acesso à câmara é necessário para a digitalização.
ru: Для сканирования необходим доступ к камере.
uk: Для сканування потрібен доступ до камери.
zh: 扫描时需要使用摄像头。

# Recipes_Add_CaptureNotSupported
source: Capture photo non supportée sur cet appareil.
cs: Pořizování fotografií není v tomto zařízení podporováno.
es: La captura de fotos no es compatible con este dispositivo.
it: L'acquisizione di foto non è supportata da questo dispositivo.
ja: このデバイスではフォトキャプチャはサポートされていません。
ko: 이 장치에서는 사진 캡처가 지원되지 않습니다.
pt_pt: A captura de fotografias não é suportada neste dispositivo.
ru: Захват фотографий не поддерживается на этом устройстве.
uk: Зйомка фотографій не підтримується на цьому пристрої.
zh: 此设备不支持照片捕捉。

# Recipes_Add_ImageTooLarge
source: L'image est trop lourde pour l'OCR. Essayez de cadrer plus serré ou baissez la résolution.
cs: Obrázek je pro OCR příliš těžký. Zkuste obrázek více oříznout nebo snížit rozlišení.
es: La imagen es demasiado pesada para el OCR. Intenta recortar la imagen o reducir la resolución.
it: L'immagine è troppo pesante per l'OCR. Provare a ritagliare l'immagine più stretta o a ridurre la risoluzione.
ja: 画像がOCRには重すぎます。画像をきつくトリミングするか、解像度を下げてみてください。
ko: 이미지가 너무 무거워 OCR이 불가능합니다. 이미지를 더 세밀하게 자르거나 해상도를 낮춰 보세요.
pt_pt: A imagem é demasiado pesada para o OCR. Tente cortar a imagem mais apertada ou reduzir a resolução.
ru: Изображение слишком тяжелое для OCR. Попробуйте обрезать изображение или уменьшить разрешение.
uk: Зображення занадто велике для розпізнавання. Спробуйте обрізати зображення або зменшити роздільну здатність.
zh: 图像太重，无法进行 OCR 识别。尝试将图像裁剪得更紧凑或降低分辨率。

# Recipes_Add_NoTextDetected
source: Aucun texte détecté. Essayez avec plus de lumière et sans flou.
cs: Nebyl zjištěn žádný text. Zkuste to s větším množstvím světla a bez rozmazání.
es: No se detecta texto. Pruebe con más luz y sin desenfoque.
it: Non viene rilevato alcun testo. Provare con più luce e senza sfocatura.
ja: テキストが検出されない。もっと明るくして、ぼかしなしで試してください。
ko: 텍스트가 감지되지 않았습니다. 조명을 더 밝게 하고 흐림 없이 시도해 보세요.
pt_pt: Não foi detectado texto. Experimente com mais luz e sem desfocagem.
ru: Текст не обнаружен. Попробуйте при большем освещении и отсутствии размытия.
uk: Текст не виявлено. Спробуйте з більшою кількістю світла і без розмиття.
zh: 未检测到文本。试着用更强的光线和不模糊的效果。

# Recipes_Add_OcrSuccess
source: ✅ Texte scanné et champs pré-remplis. Vérifiez et corrigez si besoin.
cs: ✅ Naskenovaný text a předvyplněná pole. Zkontrolujte a případně opravte.
es: ✅ Texto escaneado y campos precumplimentados. Compruebe y corrija si es necesario.
it: ✅ Testo scansionato e campi precompilati. Controllare e correggere se necessario.
ja: ✅ スキャンしたテキストと入力済みフィールド。必要に応じてチェックし、修正する。
ko: ✅ 스캔한 텍스트 및 미리 채워진 필드. 필요한 경우 확인하고 수정합니다.
pt_pt: Texto digitalizado e campos pré-preenchidos. Verificar e corrigir, se necessário.
ru: ✅ Отсканированный текст и предварительно заполненные поля. Проверьте и исправьте при необходимости.
uk: ✅ Відсканований текст та попередньо заповнені поля. Перевірте та виправте, якщо потрібно.
zh: ✅ 扫描文本和预填字段。检查并在必要时更正。

# Recipes_Title
source: Mes recettes
cs: Moje recepty
es: Mis recetas
it: Le mie ricette
ja: 私のレシピ
ko: 내 레시피
pt_pt: As minhas receitas
ru: Мои рецепты
uk: Мої рецепти
zh: 我的食谱

# Recipes_Category
source: Catégorie
cs: Kategorie
es: Categoría
it: Categoria
ja: カテゴリー
ko: 카테고리
pt_pt: Categoria
ru: Категория
uk: Категорія
zh: 类别

# Recipes_Refresh
source: Rafraîchir
cs: Obnovit
es: Actualizar
it: Aggiornare
ja: リフレッシュ
ko: 새로 고침
pt_pt: Atualizar
ru: Обновить
uk: Оновити
zh: 刷新

# Recipes_Add
source: Ajouter une recette
cs: Přidání receptu
es: Añadir una receta
it: Aggiungere una ricetta
ja: レシピを追加する
ko: 레시피 추가
pt_pt: Adicionar uma receita
ru: Добавить рецепт
uk: Додати рецепт
zh: 添加食谱

# Recipes_Empty
source: Aucune recette pour l'instant.
cs: Zatím bez receptu.
es: Aún no hay receta.
it: Non c'è ancora una ricetta.
ja: レシピはまだない。
ko: 아직 레시피가 없습니다.
pt_pt: Ainda não há receita.
ru: Рецепта пока нет.
uk: Рецепту ще немає.
zh: 还没有食谱

# Recipes_TimeFormat
source: Temps : {0} min
cs: Čas : {0} min
es: Tiempo : {0} min
it: Tempo : {0} min
ja: 時間 : {0}分
ko: 시간 : {0}분
pt_pt: Tempo : {0} min
ru: Время : {0} мин
uk: Час : {0} хв
zh: 时间：{0}分钟

# Recipes_ServiceNull
source: RecipesService est NULL (InitRestServices n'a pas été appelé après login).
cs: RecipesService je NULL (InitRestServices nebyl po přihlášení zavolán).
es: RecipesService es NULL (no se ha llamado a InitRestServices después de iniciar sesión).
it: RecipesService è NULL (InitRestServices non è stato chiamato dopo il login).
ja: RecipesServiceがNULLです（ログイン後にInitRestServicesが呼び出されていません）。
ko: RecipesService가 NULL입니다(로그인 후 InitRestServices가 호출되지 않았습니다).
pt_pt: RecipesService é NULL (InitRestServices não foi chamado após o início de sessão).
ru: RecipesService имеет значение NULL (InitRestServices не был вызван после входа в систему).
uk: RecipesService дорівнює NULL (після входу не було викликано InitRestServices).
zh: RecipesService 为空（登录后未调用 InitRestServices）。

# Recipes_IngredientsServiceNull
source: RecetteIngredientsService non initialisé.
cs: Služba RecipeIngredientsService nebyla inicializována.
es: RecipeIngredientsService no inicializado.
it: RecipeIngredientsService non inizializzato.
ja: RecipeIngredientsService が初期化されていません。
ko: RecipeIngredients서비스가 초기화되지 않았습니다.
pt_pt: RecipeIngredientsService não inicializado.
ru: RecipeIngredientsService не инициализирован.
uk: RecipeIngredientsService не ініціалізовано.
zh: RecipeIngredientsService 未初始化。

# Recipes_NoIngredients
source: (aucun ingrédient renseigné)
cs: (složení není uvedeno)
es: (no se indican los ingredientes)
it: (non sono indicati gli ingredienti)
ja: (成分表示なし）
ko: (성분 미제공)
pt_pt: (não são indicados ingredientes)
ru: (ингредиенты не указаны)
uk: (інгредієнти не вказані)
zh: (未提供成分）

# Recipes_DetailsFormat
source: Catégorie: {0} Temps: {1} min Ingrédients: {2} Instructions: {3}
cs: Kategorie: {0} Čas: {1} min Složení: 1: {2} Pokyny: 1: {3}
es: Categoría: {0} Tiempo: {1} min Ingredientes: {2} Instrucciones de uso: {3}
it: Categoria: {0} Tempo: {1} min Ingredienti: {2} Istruzioni: {3}
ja: カテゴリ： {0｝ 時間： {1}分 材料 {2} 作り方 {3}
ko: 범주: {0} 시간: {1}분 재료 {2} 지침: {3}
pt_pt: Categoria: {0} Tempo: {1} min Ingredientes: {2} Instruções: {3}
ru: Категория: {0} Время: {1} мин Ингредиенты: {2} Инструкции: {3}
uk: Категорія: {0} Час: {1} хв Інгредієнти: {2} Інструкції: {3}
zh: 类别： {0} 时间： {1} 分钟 配料 {2} 说明 {3}

# RandomMenu_Title
source: 🎲 Menu aléatoire
cs: 🎲 Náhodné menu
es: 🎲 Menú aleatorio
it: 🎲 Menu casuale
ja: 🎲 ランダムメニュー
ko: 🎲 랜덤 메뉴
pt_pt: 🎲 Menu aleatório
ru: 🎲 Произвольное меню
uk: Випадкове меню
zh: 🎲 随机菜单

# RandomMenu_GenerateButton
source: 🎲 Menu aléatoire
cs: 🎲 Náhodné menu
es: 🎲 Menú aleatorio
it: 🎲 Menu casuale
ja: 🎲 ランダムメニュー
ko: 🎲 랜덤 메뉴
pt_pt: 🎲 Menu aleatório
ru: 🎲 Произвольное меню
uk: Випадкове меню
zh: 🎲 随机菜单

# RandomMenu_DefaultText
source: Appuyez sur le bouton pour générer un menu
cs: Stisknutím tlačítka vygenerujete nabídku
es: Pulse el botón para generar un menú
it: Premere il tasto per generare un menu
ja: ボタンを押してメニューを生成する
ko: 버튼을 눌러 메뉴를 생성합니다.
pt_pt: Premir o botão para criar um menu
ru: Нажмите кнопку , чтобы создать меню
uk: Натисніть кнопку, щоб згенерувати меню
zh: 按下按钮生成菜单

# RandomMenu_SendMissingToShopping
source: 🛒 Envoyer les ingrédients manquants dans la liste de courses
cs: 🛒 Pošlete chybějící ingredience v nákupním seznamu
es: 🛒 Envía los ingredientes que faltan en la lista de la compra
it: 🛒 Inviare gli ingredienti mancanti nella lista della spesa
ja: 🛒 買い物リストに足りない食材を送る
ko: 🛒 쇼핑 목록에서 누락된 재료 보내기
pt_pt: 🛒 Enviar os ingredientes em falta na lista de compras
ru: 🛒 Внесите недостающие ингредиенты в список покупок
uk: 🛒 Надішліть відсутні інгредієнти у списку покупок
zh: 🛒 发送购物清单中缺少的配料

# RandomMenu_OpenShopping
source: 🛒 Ouvrir la liste de courses
cs: 🛒 Otevřít nákupní seznam
es: 🛒 Abrir la lista de la compra
it: 🛒 Aprire la lista della spesa
ja: 買い物リストを開く
ko: 🛒 쇼핑 목록 열기
pt_pt: 🛒 Abrir a lista de compras
ru: 🛒 Откройте список покупок
uk: 🛒 Відкрийте список покупок
zh: 🛒 打开购物清单

# RandomMenu_SendConfirmTitle
source: Envoyer ?
cs: Odeslat?
es: ¿Enviar?
it: Inviare?
ja: 送る？
ko: 보내기?
pt_pt: Enviar?
ru: Отправить?
uk: Надіслати?
zh: 发送？

# RandomMenu_SendConfirmBody
source: Il manque :
cs: Chybí:
es: Desaparecida:
it: Scomparso:
ja: 行方不明だ：
ko: 누락되었습니다:
pt_pt: Falta:
ru: Пропажа:
uk: Пропав:
zh: 失踪：
