Repository: Fpied/LoGeCui
Catalog: LoGeCuiMobile/Resources/Lang/AppResources.*.resx
Languages: cs, es, it, ja, ko, pt_pt, ru, uk, zh

# RandomMenu_SentButton
source: 🛒 Ingrédients envoyés
cs: 🛒 Odeslané složky
es: 🛒 Ingredientes enviados
it: 🛒 Ingredienti inviati
ja: 送付された 🛒 原材料
ko: 🛒 보낸 재료
pt_pt: 🛒 Ingredientes enviados
ru: 🛒 Ингредиенты отправлены
uk: 🛒 Інгредієнти відправлені
zh: 🛒 发送的食材

# RandomMenu_Generating
source: ⏳ Génération du menu (Entrée / Plat / Dessert)…
cs: ⏳ Tvorba menu (Předkrm / Hlavní chod / Dezert)...
es: ⏳ Generación de menús (Entrante / Plato principal / Postre)....
it: ⏳ Generazione del menu (antipasto / piatto principale / dessert)...
ja: メニュー作成（前菜／メイン／デザート）...
ko: 메뉴 생성(스타터/메인 코스/디저트)... ⏳ 메뉴 생성...
pt_pt: Geração de menus (Entrada / Prato principal / Sobremesa)...
ru: ⏳ Составление меню (закуска / основное блюдо / десерт)...
uk: ⏳ Формування меню (Закуска / Основна страва / Десерт)...
zh: ⏳ 菜单生成（前菜/主菜/甜点）...

# RandomMenu_NoRecipes
source: Aucune recette disponible.
cs: Žádný recept není k dispozici.
es: No hay receta disponible.
it: Nessuna ricetta disponibile.
ja: レシピはありません。
ko: 사용 가능한 레시피가 없습니다.
pt_pt: Não existe receita disponível.
ru: Рецепт отсутствует.
uk: Рецепту немає.
zh: 无食谱。

# RandomMenu_CannotGenerate
source: Impossible de générer un menu Entrée/Plat/Dessert.
cs: Nelze vygenerovat nabídku předkrmů/hlavních chodů/dezertů.
es: No se puede generar un menú de entrante/principal/postre.
it: Impossibile generare un menu antipasto/primo piatto/dessert.
ja: スターター/メインコース/デザートのメニューが作成できません。
ko: 스타터/메인 코스/디저트 메뉴를 생성할 수 없습니다.
pt_pt: Não é possível gerar um menu de entrada/prato principal/sobremesa.
ru: Невозможно создать меню закусок, основных блюд и десертов.
uk: Не вдається створити меню "Закуски/Основні страви/Десерти".
zh: 无法生成前菜/主菜/甜点菜单。

# RandomMenu_CountsFormat
source: Entrées: {0} Plats: {1} Desserts: {2}
cs: Startéry: {0} Hlavní jídla: {1} Dezerty: {2}
es: Entrantes: {0} Platos principales: {1} Postres: {2}
it: Antipasti: {0} Piatti principali: {1} Dessert: {2}
ja: 前菜: {0｝ メインディッシュ: {1｝ デザート: {2｝
ko: 스타터: {0} 메인 코스: {1} 디저트: {2}
pt_pt: Entradas: {0} Pratos principais: {1} Sobremesas: {2}
ru: Закуски: {0} Основные блюда: {1} Десерты: {2}
uk: Закуски: {0} Другі страви: {1} Десерти: {2}
zh: 开胃菜： {0} 主菜：{1｝ 甜点：{2｝

# RandomMenu_CheckCategories
source: Vérifie que tes recettes ont bien 'categorie' = Entree / Plat / Dessert en DB.
cs: Zkontrolujte, zda je v DB u vašich receptů uvedeno 'category' = Main course / Hlavní jídlo / Dezert.
es: Compruebe que sus recetas tienen 'categoría' = Plato principal / Plato fuerte / Postre en DB.
it: Controllare che le ricette abbiano la 'categoria' = Piatto principale / Piatto principale / Dessert nel DB.
ja: レシピのDBに'category' = Main course / Main course / Dessertがあるか確認してください。
ko: 레시피의 '카테고리'가 DB에서 메인 코스/메인 코스/디저트인지 확인하세요.
pt_pt: Verifique se as suas receitas têm "categoria" = Prato principal / Prato principal / Sobremesa na BD.
ru: Убедитесь, что в DB у ваших рецептов есть 'category' = Main course / Main course / Dessert.
uk: Переконайтеся, що ваші рецепти мають у БД 'category' = Основна страва / Друга страва / Десерт.
zh: 检查您的食谱在数据库中是否有 "类别"=主菜/主菜/甜点。

# RandomMenu_GeneratedHeader
source: ✅ Menu généré :
cs: ✅ Vygenerované menu :
es: ✅ Menú generado :
it: ✅ Menu generato :
ja: メニュー生成 ✅ ：
ko: ✅ 메뉴 생성됨 :
pt_pt: ✅ Menu gerado :
ru: ✅ Созданное меню :
uk: ✅ Меню сформовано :
zh: ✅ 生成菜单 ：

# RandomMenu_NoIngredientsForRecipe
source: Ingrédients : (aucun ingrédient enregistré pour cette recette)
cs: Ingredience : (u tohoto receptu nejsou uvedeny žádné ingredience)
es: Ingredientes : (esta receta no lleva ingredientes)
it: Ingredienti : (nessun ingrediente elencato per questa ricetta)
ja: 材料 : (このレシピには材料は記載されていません)
ko: 원재료 : (이 레시피에 기재된 재료는 없습니다)
pt_pt: Ingredientes : (não há ingredientes listados para esta receita)
ru: Ингредиенты : (для этого рецепта ингредиенты не указаны)
uk: Інгредієнти: (для цього рецепта інгредієнти не вказані)
zh: 配料：（此食谱未列出配料）

# RandomMenu_IngredientsHeader
source: Ingrédients :
cs: Složení:
es: Ingredientes:
it: Ingredienti:
ja: 原材料
ko: 재료:
pt_pt: Ingredientes:
ru: Ингредиенты:
uk: Інгредієнти:
zh: 成分

# RandomMenu_MissingNone
source: Manquants : aucun
cs: Chybí: žádný
es: Falta: ninguno
it: Mancante: nessuno
ja: 欠場：なし
ko: 누락됨: 없음
pt_pt: Em falta: nenhum
ru: Отсутствует: нет
uk: Відсутні: немає
zh: 缺失：无

# RandomMenu_MissingHeader
source: Manquants :
cs: Chybí:
es: Desaparecida:
it: Scomparso:
ja: 行方不明だ：
ko: 누락되었습니다:
pt_pt: Falta:
ru: Пропажа:
uk: Пропав:
zh: 失踪：

# RandomMenu_CannotComputeMissing
source: Impossible de calculer les ingrédients manquants : certaines recettes n’ont pas d’ingrédients enregistrés.
cs: Nelze vypočítat chybějící přísady: u některých receptů nejsou zaznamenány žádné přísady.
es: Imposibilidad de calcular los ingredientes que faltan: algunas recetas no tienen ingredientes registrados.
it: Impossibile calcolare gli ingredienti mancanti: alcune ricette non hanno ingredienti registrati.
ja: 不足している材料の計算ができない：材料が記録されていないレシピがある。
ko: 누락된 재료 계산 불가능: 일부 레시피에는 재료가 기록되어 있지 않습니다.
pt_pt: Impossível calcular os ingredientes em falta: algumas receitas não têm ingredientes registados.
ru: Невозможно подсчитать недостающие ингредиенты: в некоторых рецептах ингредиенты не записаны.
uk: Неможливо обчислити відсутні інгредієнти: деякі рецепти не містять жодного інгредієнта.
zh: 无法计算缺少的配料：有些食谱没有记录配料。

# RandomMenu_AllAvailable
source: ✅ Tout est disponible. Aucun ingrédient manquant.
cs: ✅ Vše je k dispozici. Žádné chybějící ingredience.
es: ✅ Todo está disponible. No faltan ingredientes.
it: ✅ Tutto è disponibile. Nessun ingrediente mancante.
ja: ✅ すべて揃っている。足りない食材はない。
ko: ✅ 모든 것이 준비되어 있습니다. 누락된 재료가 없습니다.
pt_pt: Tudo está disponível. Não faltam ingredientes.
ru: ✅ Все есть в наличии. Никаких недостающих ингредиентов.
uk: ✅ Все є в наявності. Немає відсутніх інгредієнтів.
zh: ✅ 应有尽有。不缺配料。

# RandomMenu_GlobalMissingHeader
source: Liste globale des ingrédients manquants :
cs: Globální seznam chybějících složek :
es: Lista global de ingredientes que faltan :
it: Elenco globale degli ingredienti mancanti :
ja: グローバル欠落成分リスト：
ko: 누락된 성분의 글로벌 목록 :
pt_pt: Lista global de ingredientes em falta :
ru: Глобальный список недостающих ингредиентов:
uk: Глобальний список відсутніх інгредієнтів :
zh: 全球缺失成分清单 ：

# Reset_Title
source: Réinitialisation
cs: Obnovení
es: Restablecer
it: Reset
ja: リセット
ko: 초기화
pt_pt: Reiniciar
ru: Сброс
uk: Перезавантаження
zh: 重置

# Reset_Header
source: Réinitialiser votre mot de passe
cs: Obnovení hesla
es: Restablecer contraseña
it: Reimpostare la password
ja: パスワードのリセット
ko: 비밀번호 재설정
pt_pt: Repor a sua palavra-passe
ru: Сбросить пароль
uk: Скинути пароль
zh: 重置密码

# Reset_NewPassword
source: Nouveau mot de passe
cs: Nové heslo
es: Nueva contraseña
it: Nuova password
ja: 新しいパスワード
ko: 새 비밀번호
pt_pt: Nova palavra-passe
ru: Новый пароль
uk: Новий пароль
zh: 新密码

# Reset_ConfirmPassword
source: Confirmer le mot de passe
cs: Potvrzení hesla
es: Confirmar contraseña
it: Confermare la password
ja: パスワードの確認
ko: 비밀번호 확인
pt_pt: Confirmar a palavra-passe
ru: Подтвердите пароль
uk: Підтвердити пароль
zh: 确认密码

# Reset_Submit
source: Valider
cs: Potvrďte
es: Confirme
it: Confermare
ja: 確認
ko: 확인
pt_pt: Confirmar
ru: Подтвердите
uk: Підтвердити
zh: 确认

# Reset_PwdMinLength
source: Le mot de passe doit contenir au moins 6 caractères.
cs: Heslo musí obsahovat alespoň 6 znaků.
es: La contraseña debe contener al menos 6 caracteres.
it: La password deve contenere almeno 6 caratteri.
ja: パスワードは6文字以上でなければならない。
ko: 비밀번호는 6자 이상이어야 합니다.
pt_pt: A palavra-passe deve conter pelo menos 6 caracteres.
ru: Пароль должен содержать не менее 6 символов.
uk: Пароль повинен містити щонайменше 6 символів.
zh: 密码必须至少包含 6 个字符。

# Reset_PwdMismatch
source: Les mots de passe ne correspondent pas.
cs: Hesla se neshodují.
es: Las contraseñas no coinciden.
it: Le password non corrispondono.
ja: パスワードが一致しない。
ko: 비밀번호가 일치하지 않습니다.
pt_pt: As palavras-passe não coincidem.
ru: Пароли не совпадают.
uk: Паролі не збігаються.
zh: 密码不匹配。

# Reset_Updating
source: ⏳ Mise à jour en cours...
cs: ⏳ Probíhá aktualizace...
es: ⏳ Actualización en curso...
it: ⏳ Aggiornamento in corso...
ja: ⏳ アップデート中...
ko: ⏳ 업데이트 진행 중...
pt_pt: Atualização em curso...
ru: ⏳ Обновление в процессе...
uk: Оновлення в процесі...
zh: ⏳ 更新中...

# Reset_DoneTitle
source: ✅ Terminé
cs: ✅ Dokončeno
es: ✅ Terminado
it: ✅ Finito
ja: ✅ 終了した
ko: ✅ 완료
pt_pt: ✅ Acabado
ru: ✅ Закончено
uk: ✅ Готово
zh: ✅ 已完成

# Reset_DoneBody
source: Votre mot de passe a été modifié. Vous pouvez vous connecter.
cs: Vaše heslo bylo změněno. Nyní se můžete přihlásit.
es: Su contraseña ha sido modificada. Ya puede iniciar sesión.
it: La password è stata modificata. Ora è possibile accedere.
ja: パスワードが変更されました。ログインできるようになりました。
ko: 비밀번호가 변경되었습니다. 이제 로그인할 수 있습니다.
pt_pt: A sua palavra-passe foi alterada. Já pode iniciar sessão.
ru: Ваш пароль был изменен. Теперь вы можете войти в систему.
uk: Ваш пароль було змінено. Тепер ви можете увійти в систему.
zh: 您的密码已更改。您现在可以登录。

# Reset_Failed
source: Impossible de modifier le mot de passe.
cs: Nelze změnit heslo.
es: No se puede cambiar la contraseña.
it: Impossibile modificare la password.
ja: パスワードを変更できません。
ko: 비밀번호를 변경할 수 없습니다.
pt_pt: Não é possível alterar a palavra-passe.
ru: Невозможно изменить пароль.
uk: Не вдалося змінити пароль.
zh: 无法更改密码。

# Settings_Title
source: Paramètres
cs: Parametry
es: Parámetros
it: Parametri
ja: パラメータ
ko: 매개변수
pt_pt: Parâmetros
ru: Параметры
uk: Параметри
zh: 参数

# Settings_Account
source: Compte
cs: Účet
es: Cuenta
it: Conto
ja: アカウント
ko: 계정
pt_pt: Conta
ru: Счет
uk: Обліковий запис
zh: 账户

# Settings_Logout
source: Déconnexion
cs: Odpojení
es: Desconexión
it: Disconnessione
ja: 切断
ko: 연결 해제
pt_pt: Desconexão
ru: Отключение
uk: Відключення
zh: 断开连接

# Settings_DangerZone
source: Zone dangereuse
cs: Nebezpečná oblast
es: Zona peligrosa
it: Area pericolosa
ja: 危険区域
ko: 위험 지역
pt_pt: Zona de risco
ru: Опасная зона
uk: Небезпечна зона
zh: 危险区域

# Settings_Unsubscribe
source: Désinscription
cs: Odhlásit se z odběru
es: Cancelar suscripción
it: Annullamento dell'iscrizione
ja: 登録解除
ko: 구독 취소
pt_pt: Cancelar a subscrição
ru: Отписаться от рассылки
uk: Відмовитися від підписки
zh: 取消订阅

# Settings_DeleteConfirmTitle
source: Désinscription
cs: Odhlásit se z odběru
es: Cancelar suscripción
it: Annullamento dell'iscrizione
ja: 登録解除
ko: 구독 취소
pt_pt: Cancelar a subscrição
ru: Отписаться от рассылки
uk: Відмовитися від підписки
zh: 取消订阅

# Settings_DeleteConfirmBody
source: Es-tu sûr de vouloir supprimer ton compte ? Cette action est irréversible.
cs: Opravdu chcete svůj účet odstranit? Tato akce je nevratná.
es: ¿Está seguro de que desea eliminar su cuenta? Esta acción es irreversible.
it: Siete sicuri di voler cancellare il vostro account? Questa azione è irreversibile.
ja: 本当にアカウントを削除しますか？このアクションは不可逆的です。
ko: 정말 계정을 삭제하시겠습니까? 이 작업은 되돌릴 수 없습니다.
pt_pt: Tem a certeza de que pretende apagar a sua conta? Esta ação é irreversível.
ru: Вы уверены, что хотите удалить свою учетную запись? Это действие необратимо.
uk: Ви впевнені, що хочете видалити свій обліковий запис? Ця дія є незворотною.
zh: 您确定要删除账户吗？此操作不可逆转。

# Settings_DeleteConfirmYes
source: Oui, supprimer
cs: Ano, vymazat
es: Sí, borrar
it: Sì, eliminare
ja: はい、削除
ko: 예, 삭제
pt_pt: Sim, apagar
ru: Да, удалить
uk: Так, видалити
zh: 是，删除

# Settings_SupabaseNull
source: Supabase non initialisé. Reconnectez-vous.
cs: Supabáze nebyla inicializována. Znovu se připojte.
es: Supabase no inicializada. Reconectar.
it: Supabase non inizializzato. Ricollegare.
ja: スーパーベースが初期化されていない。再接続してください。
ko: 수퍼베이스가 초기화되지 않았습니다. 다시 연결합니다.
pt_pt: A base de dados não foi inicializada. Reconectar.
ru: Supabase не инициализирована. Переподключитесь.
uk: Supabase не ініціалізовано. Перепідключись.
zh: 超级数据库未初始化。重新连接。

# Settings_DeleteFailed
source: Suppression impossible : {0}
cs: Nelze smazat: {0}
es: No se puede borrar: {0}
it: Non può essere cancellato: {0}
ja: 削除できません: {0｝
ko: 삭제할 수 없습니다: {0}
pt_pt: Não pode ser eliminado: {0}
ru: Невозможно удалить: {0}
uk: Неможливо видалити: {0}
zh: 无法删除： {0}

# Settings_DeleteSuccess
source: ✅ Votre compte a été supprimé.
cs: ✅ Váš účet byl smazán.
es: Tu cuenta ha sido eliminada.
it: Il suo account è stato cancellato.
ja: アカウントが削除されました。
ko: ✅ 계정이 삭제되었습니다.
pt_pt: A sua conta foi eliminada.
ru: ✅ Ваша учетная запись была удалена.
uk: ✅ Ваш обліковий запис видалено.
zh: ✅ 您的账户已被删除。

# OcrTitle
source: OCR
ja: 光学式文字認識
uk: РОЗПІЗНАВАННЯ ТЕКСТУ
